# 🔐 Токен Telegram-бота от @BotFather
BOT_TOKEN = "8112365645:AAH-GiiMfepHL_Xd1Micc_SvzmSqSNhyTWI"

# 🛡 ID админа (используется для доступа к команде /addmovie)
ADMIN_ID = 402765909

# 🧑‍💻 Username админа (для сообщений типа "фильм не найден, сообщите администратору")
ADMIN_USERNAME = "@kinotuts"

# 📢 Список каналов, на которые нужно быть подписанным (без @ в тексте, но с @ в коде)
CHANNELS = [
    "@kinommt",
    "@H4LYAVA",
    "@tyrych",
    "@Echo_Epoch"
]

# 🗃 Путь к JSON-файлу с базой фильмов
DB_PATH = "movies_db.json"
